0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101008; // 1 atm

boundaryField
{
    inlet
    {
        type            fixedValue;
	    value		    uniform 3e06; // 30 bar combustion chamber
    }

    // source: https://openfoamwiki.net/index.php/HowTo_Using_the_WaveTransmissive_Boundary_condition
    outlet
    {
        type            waveTransmissive;
        value           uniform 101008;   //important for correct I/O
        gamma           1.4;              //the ratio of specific heats

        // field           p;                //the name of the field that we are working on
        // phi             phiv;             //the name of the volumetric flux field ( or if you use the mass flux phi, it will be divided by rho)
        // rho             rho;              //the name of the density field
        // psi             psi;              //the name of the field that is the deriv. of density with respect to pressure
        // lInf            0.05;             //a measure of how far away the far-field condition should be
        // fieldInf        101008;           //the far-field value to be applied to p
    }


    symmetry
    {
        type            symmetry;
    }


    walls
    {
        type            zeroGradient;
    }


    front	
    {
        type            empty;
    }


    back
    {
        type            empty;
    }


    far_field
    {
        type            fixedValue;
	    value		    uniform 101008; // 1 atm
    }
}

// ************************************************************************* //
