0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inlet
    {
        type            fixedValue;
	    value		    uniform 2800;
    }

    outlet
    { // REVIEW: exit plume temperature should be much higher than this value?
        type            fixedValue;
	    value		    uniform 298;
    }


    symmetry
    {
        type            symmetry;
    }


    walls
    {
        type            zeroGradient;
    }


    front
    {
        type            empty;
    }


    back
    {
        type            empty;
    }


    far_field
    {
        type            fixedValue;
	    value		    uniform 298;
    }
}

// ************************************************************************* //
