0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* ++++++++++++++++++++++++++++++++ */
// <-- Turbulent Kinetic Energy --> //
/* ++++++++++++++++++++++++++++++++ */

// Re   = rho * U_inf * L / mu    (mu: dynamic viscosity, rho: density)
// I    = 0.16*Re^(-1/8)
// k    = (3/2)*(U_inf * I)^2 

// source: https://en.wikipedia.org/wiki/Turbulence_kinetic_energy

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// walls:       fixedValue      0
// free stream: fixedValue      10^-5*U_inf^2 / Re < k < 0.1*U_inf^2 / Re

// source: https://curiosityfluids.com/2019/02/11/basic-komega-sst-boundary-conditions/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12; // Considering static air (U_inf = 0) as the initial state.

boundaryField
{

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetry;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 1e-12;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    far_field
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
