0/nut.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* ++++++++++++++++++++++++++++++++++++++ */
// <-- Kinematic Turbulence Viscosity --> //
/* ++++++++++++++++++++++++++++++++++++++ */

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    /*
    source: https://www.cfd-online.com/Forums/openfoam-pre-processing/140984-what-does-calculated-boundary-condition-mean-0-nut-file.html
    calculated means, that the property you are referring to is already fully defined by the other boundary conditions and properties you defined in the constant folder.
    */

    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    symmetry
    {
        type            symmetry;
    }

    walls
    {
        type            nutkWallFunction; // only entry of importance
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    far_field
    {
        type            calculated; 
        value           uniform 0;
    }
}


// ************************************************************************* //
