system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Tadmor;

ddtSchemes
{
    default        localEuler rDeltaT;

}

gradSchemes
{
    default cellLimited leastSquares 1;
}

divSchemes
{
    default none;
    div(tauMC) Gauss linear;
    div(phi,k) Gauss Gamma 1;
    div(phi,omega) Gauss Gamma 1;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
    reconstruct(rho) Gamma 1;
    reconstruct(U) GammaV 1;
    reconstruct(T) Gamma 1;
}

snGradSchemes
{
    default corrected;
}

fluxRequired
{
    default no;    
    p;
}

wallDist
{
    method meshWave;

    // Optional entry enabling the calculation
    // of the normal-to-wall field
    nRequired false;

    // Optional entry delaying wall distance update to every n steps
    // Default is 1 (update every step)
    updateInterval 5;
}

// ************************************************************************* //
