system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    // rho
    // {
    //     solver          diagonal;
    // }

    // rhoU
    // {
    //     solver          diagonal;
    // }

    // rhoE
    // {
    //     solver          diagonal;
    // }
    
    // U
    // {
    //     solver          smoothSolver;
    //     smoother        GaussSeidel;
    //     nSweeps         2;
    //     tolerance       1e-09;
    //     relTol          0.01;
    // }

    // e
    // {
    //     solver          smoothSolver;
    //     smoother        GaussSeidel;
    //     nSweeps         2;
    //     tolerance       1e-09;
    //     relTol          0.01;
    // }

    // omega
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-08;
    //     relTol          0.01;
    // }

    // k
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-08;
    //     relTol          0.01;
    // }


    // h
    // {
    //     $U;
    //     tolerance       1e-10;
    //     relTol          0;
    // }

    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-12;
        relTol          0;

    }

    "(e|omega|k|R|epsilon|h)"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
    
    p
    {
        solver GAMG;
        tolerance 1e-08;     
        relTol 0.01;     
        smoother GaussSeidel;     
        cacheAgglomeration off;     
        nCellsInCoarsestLevel 20;     
        agglomerator faceAreaPair;     
        mergeLevels 1;
    }

}

// Note: The solver could not solve the problem without outputing a negative temperature (K)
// Thus we tried these two methods without much success
fieldBounds
{
    p       1e-12   3e07;
    T       1e-12   4000;
}


// ************************************************************************* //
