system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 298
    volScalarFieldValue p 101008
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (-0.1 0 0) (0.1 0.18 0.09);
        fieldValues
        (
            volScalarFieldValue T 2800
            volScalarFieldValue p 3e06
            volVectorFieldValue U (0 0 0)
        );
    }
);


// ************************************************************************* //
